jagmljk/MSP432-Embedded-Systems-Suite/Project 2/HAL/Graphics.h
// Graphics.h - LCD graphics functions

#ifndef HAL_GRAPHICS_H_
#define HAL_GRAPHICS_H_

#include <HAL/LcdDriver/Crystalfontz128x128_ST7735.h>
#include <ti/devices/msp432p4xx/driverlib/driverlib.h>
#include <ti/grlib/grlib.h>

#define FG_COLOR GRAPHICS_COLOR_WHITE
#define BG_COLOR GRAPHICS_COLOR_BLACK

struct _GFX {
    Graphics_Context context;
    uint32_t foreground;
    uint32_t background;
    uint32_t defaultForeground;
    uint32_t defaultBackground;
};
typedef struct _GFX GFX;

GFX GFX_construct(uint32_t defaultForeground, uint32_t defaultBackground);

void GFX_resetColors(GFX* gfx_p);
void GFX_clear(GFX* gfx_p);

void GFX_print(GFX* gfx_p, char* string, float row, float col);
void GFX_eraseText(GFX* gfx_p, char* string, float row, float col);
int GFX_printTextRows(GFX* gfx_p, char* strings[], int numStrings, float firstRow, float col);

void GFX_setForeground(GFX* gfx_p, uint32_t foreground);
void GFX_setBackground(GFX* gfx_p, uint32_t background);

void GFX_drawSolidCircle(GFX* gfx_p, int x, int y, int radius);
void GFX_drawHollowCircle(GFX* gfx_p, int x, int y, int radius);
void GFX_removeSolidCircle(GFX* gfx_p, int x, int y, int radius);
void GFX_removeHollowCircle(GFX* gfx_p, int x, int y, int radius);

void GFX_drawSolidRectangle(GFX* gfx_p, int x1, int x2, int y1, int y2);
void GFX_drawHollowRectangle(GFX* gfx_p, int x1, int x2, int y1, int y2);
void GFX_removeSolidRectangle(GFX* gfx_p, int x1, int x2, int y1, int y2);

void GFX_drawLine(GFX* gfx_p, int x1, int y1, int x2, int y2);

#endif /* HAL_GRAPHICS_H_ */
